data/Section 5/5.1/Clients/VM2_Intance1/rep2/output_C2_T1_W64_K6_R2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       36884 ops,     451 (avg:     409) ops/sec, 1.60MB/sec (avg: 1.46MB/sec),  4.41 (avg:  4.87) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         204.92          ---          ---      4.67800       212.80
Gets         204.90      1229.39         0.00      5.05200      1279.15
Waits          0.00          ---          ---      0.00000          ---
Totals       409.82      1229.39         0.00      4.86500      1491.95


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.800         0.01
SET       1.900         0.15
SET       2.000         0.79
SET       2.100         2.09
SET       2.200         4.37
SET       2.300         7.88
SET       2.400        12.04
SET       2.500        16.66
SET       2.600        20.81
SET       2.700        24.85
SET       2.800        28.53
SET       2.900        31.55
SET       3.000        34.27
SET       3.100        36.65
SET       3.200        39.03
SET       3.300        40.89
SET       3.400        42.70
SET       3.500        44.17
SET       3.600        45.54
SET       3.700        46.86
SET       3.800        48.08
SET       3.900        49.16
SET       4.000        50.46
SET       4.100        51.63
SET       4.200        52.76
SET       4.300        53.93
SET       4.400        55.11
SET       4.500        56.27
SET       4.600        57.40
SET       4.700        58.63
SET       4.800        59.59
SET       4.900        60.59
SET       5.000        61.74
SET       5.100        62.80
SET       5.200        63.87
SET       5.300        64.95
SET       5.400        66.19
SET       5.500        67.14
SET       5.600        68.45
SET       5.700        69.86
SET       5.800        71.47
SET       5.900        72.95
SET       6.000        74.49
SET       6.100        76.11
SET       6.200        77.63
SET       6.300        79.16
SET       6.400        80.78
SET       6.500        82.31
SET       6.600        83.94
SET       6.700        85.15
SET       6.800        86.21
SET       6.900        87.19
SET       7.000        88.07
SET       7.100        88.80
SET       7.200        89.58
SET       7.300        90.18
SET       7.400        90.76
SET       7.500        91.29
SET       7.600        91.77
SET       7.700        92.20
SET       7.800        92.63
SET       7.900        92.97
SET       8.000        93.33
SET       8.100        93.68
SET       8.200        93.94
SET       8.300        94.15
SET       8.400        94.33
SET       8.500        94.54
SET       8.600        94.79
SET       8.700        95.00
SET       8.800        95.19
SET       8.900        95.37
SET       9.000        95.60
SET       9.100        95.81
SET       9.200        95.97
SET       9.300        96.12
SET       9.400        96.27
SET       9.500        96.43
SET       9.600        96.57
SET       9.700        96.73
SET       9.800        96.89
SET       9.900        97.04
SET      10.000        97.65
SET      11.000        98.29
SET      12.000        98.69
SET      13.000        98.95
SET      14.000        99.18
SET      15.000        99.36
SET      16.000        99.46
SET      17.000        99.57
SET      18.000        99.63
SET      19.000        99.72
SET      20.000        99.78
SET      21.000        99.82
SET      22.000        99.84
SET      23.000        99.86
SET      24.000        99.89
SET      25.000        99.91
SET      26.000        99.92
SET      27.000        99.94
SET      28.000        99.95
SET      29.000        99.96
SET      30.000        99.96
SET      31.000        99.97
SET      34.000        99.98
SET      35.000        99.98
SET      45.000        99.99
SET      46.000        99.99
SET      58.000       100.00
---
GET       2.100         0.01
GET       2.200         0.06
GET       2.300         0.40
GET       2.400         1.32
GET       2.500         3.05
GET       2.600         5.88
GET       2.700         9.50
GET       2.800        13.76
GET       2.900        17.87
GET       3.000        22.16
GET       3.100        26.18
GET       3.200        29.95
GET       3.300        33.21
GET       3.400        36.09
GET       3.500        38.58
GET       3.600        40.88
GET       3.700        42.62
GET       3.800        44.25
GET       3.900        45.65
GET       4.000        47.23
GET       4.100        48.51
GET       4.200        49.76
GET       4.300        50.90
GET       4.400        52.08
GET       4.500        53.13
GET       4.600        54.23
GET       4.700        55.14
GET       4.800        56.31
GET       4.900        57.38
GET       5.000        58.43
GET       5.100        59.48
GET       5.200        60.58
GET       5.300        61.91
GET       5.400        63.10
GET       5.500        64.29
GET       5.600        65.44
GET       5.700        66.51
GET       5.800        67.74
GET       5.900        69.00
GET       6.000        70.32
GET       6.100        71.54
GET       6.200        72.86
GET       6.300        74.45
GET       6.400        75.89
GET       6.500        77.54
GET       6.600        79.03
GET       6.700        80.45
GET       6.800        82.00
GET       6.900        83.40
GET       7.000        84.47
GET       7.100        85.64
GET       7.200        86.74
GET       7.300        87.66
GET       7.400        88.50
GET       7.500        89.25
GET       7.600        89.99
GET       7.700        90.63
GET       7.800        91.25
GET       7.900        91.66
GET       8.000        92.14
GET       8.100        92.47
GET       8.200        92.77
GET       8.300        93.06
GET       8.400        93.32
GET       8.500        93.58
GET       8.600        93.82
GET       8.700        94.06
GET       8.800        94.26
GET       8.900        94.47
GET       9.000        94.68
GET       9.100        94.91
GET       9.200        95.08
GET       9.300        95.24
GET       9.400        95.43
GET       9.500        95.63
GET       9.600        95.73
GET       9.700        95.93
GET       9.800        96.07
GET       9.900        96.18
GET      10.000        96.94
GET      11.000        97.88
GET      12.000        98.48
GET      13.000        98.78
GET      14.000        99.00
GET      15.000        99.15
GET      16.000        99.32
GET      17.000        99.40
GET      18.000        99.53
GET      19.000        99.61
GET      20.000        99.66
GET      21.000        99.72
GET      22.000        99.78
GET      23.000        99.80
GET      24.000        99.84
GET      25.000        99.84
GET      26.000        99.86
GET      27.000        99.87
GET      28.000        99.89
GET      30.000        99.90
GET      33.000        99.91
GET      39.000        99.91
GET      40.000        99.92
GET      43.000        99.93
GET      44.000        99.94
GET      45.000        99.95
GET      48.000        99.95
GET      50.000        99.96
GET      52.000        99.97
GET      58.000        99.97
GET      70.000        99.98
GET      76.000        99.98
GET      95.000        99.99
GET     100.000        99.99
GET     140.000       100.00
---